espressif/esp-idf/components/soc/esp32s31/include/modem/modem_widgets_reg.h
/**
 * SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif
#include "reg_base.h"

#define MODEM_WIDGETS_CLK_CONF_REG          (DR_REG_MODEM_WIDGETS_BASE + 0x0)
/* MODEM_WIDGETS_CLK_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define MODEM_WIDGETS_CLK_EN    (BIT(0))
#define MODEM_WIDGETS_CLK_EN_M  (BIT(0))
#define MODEM_WIDGETS_CLK_EN_V  0x1
#define MODEM_WIDGETS_CLK_EN_S  0

#define MODEM_WIDGETS_MODEM_DIAG_FIX_SEL_REG          (DR_REG_MODEM_WIDGETS_BASE + 0x4)
/* MODEM_WIDGETS_DIAG_BUS_FIX_LOW_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: .*/
#define MODEM_WIDGETS_DIAG_BUS_FIX_LOW_EN    (BIT(10))
#define MODEM_WIDGETS_DIAG_BUS_FIX_LOW_EN_M  (BIT(10))
#define MODEM_WIDGETS_DIAG_BUS_FIX_LOW_EN_V  0x1
#define MODEM_WIDGETS_DIAG_BUS_FIX_LOW_EN_S  10
/* MODEM_WIDGETS_DIAG_BUS_FIX_SEL_LOW : R/W ;bitpos:[9:5] ;default: 5'd0 ; */
/*description: .*/
#define MODEM_WIDGETS_DIAG_BUS_FIX_SEL_LOW    0x0000001F
#define MODEM_WIDGETS_DIAG_BUS_FIX_SEL_LOW_M  ((MODEM_WIDGETS_DIAG_BUS_FIX_SEL_LOW_V)<<(MODEM_WIDGETS_DIAG_BUS_FIX_SEL_LOW_S))
#define MODEM_WIDGETS_DIAG_BUS_FIX_SEL_LOW_V  0x1F
#define MODEM_WIDGETS_DIAG_BUS_FIX_SEL_LOW_S  5
/* MODEM_WIDGETS_DIAG_BUS_FIX_SEL_HIGH : R/W ;bitpos:[4:0] ;default: 5'd0 ; */
/*description: .*/
#define MODEM_WIDGETS_DIAG_BUS_FIX_SEL_HIGH    0x0000001F
#define MODEM_WIDGETS_DIAG_BUS_FIX_SEL_HIGH_M  ((MODEM_WIDGETS_DIAG_BUS_FIX_SEL_HIGH_V)<<(MODEM_WIDGETS_DIAG_BUS_FIX_SEL_HIGH_S))
#define MODEM_WIDGETS_DIAG_BUS_FIX_SEL_HIGH_V  0x1F
#define MODEM_WIDGETS_DIAG_BUS_FIX_SEL_HIGH_S  0

#define MODEM_WIDGETS_MODEM_DIAG_EXCHANGE_REG          (DR_REG_MODEM_WIDGETS_BASE + 0x8)
/* MODEM_WIDGETS_DIAG_BUS_EXCHANGE3_SEL : R/W ;bitpos:[15:12] ;default: 4'd0 ; */
/*description: .*/
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE3_SEL    0x0000000F
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE3_SEL_M  ((MODEM_WIDGETS_DIAG_BUS_EXCHANGE3_SEL_V)<<(MODEM_WIDGETS_DIAG_BUS_EXCHANGE3_SEL_S))
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE3_SEL_V  0xF
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE3_SEL_S  12
/* MODEM_WIDGETS_DIAG_BUS_EXCHANGE2_SEL : R/W ;bitpos:[11:8] ;default: 4'd0 ; */
/*description: .*/
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE2_SEL    0x0000000F
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE2_SEL_M  ((MODEM_WIDGETS_DIAG_BUS_EXCHANGE2_SEL_V)<<(MODEM_WIDGETS_DIAG_BUS_EXCHANGE2_SEL_S))
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE2_SEL_V  0xF
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE2_SEL_S  8
/* MODEM_WIDGETS_DIAG_BUS_EXCHANGE1_SEL : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: .*/
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE1_SEL    0x0000000F
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE1_SEL_M  ((MODEM_WIDGETS_DIAG_BUS_EXCHANGE1_SEL_V)<<(MODEM_WIDGETS_DIAG_BUS_EXCHANGE1_SEL_S))
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE1_SEL_V  0xF
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE1_SEL_S  4
/* MODEM_WIDGETS_DIAG_BUS_EXCHANGE0_SEL : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: .*/
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE0_SEL    0x0000000F
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE0_SEL_M  ((MODEM_WIDGETS_DIAG_BUS_EXCHANGE0_SEL_V)<<(MODEM_WIDGETS_DIAG_BUS_EXCHANGE0_SEL_S))
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE0_SEL_V  0xF
#define MODEM_WIDGETS_DIAG_BUS_EXCHANGE0_SEL_S  0

#define MODEM_WIDGETS_DATE_REG          (DR_REG_MODEM_WIDGETS_BASE + 0xC)
/* MODEM_WIDGETS_DATE : R/W ;bitpos:[27:0] ;default: 28'h2202221 ; */
/*description: .*/
#define MODEM_WIDGETS_DATE    0x0FFFFFFF
#define MODEM_WIDGETS_DATE_M  ((MODEM_WIDGETS_DATE_V)<<(MODEM_WIDGETS_DATE_S))
#define MODEM_WIDGETS_DATE_V  0xFFFFFFF
#define MODEM_WIDGETS_DATE_S  0

#ifdef __cplusplus
}
#endif
